# 加油站
# [中等]
# 在一条环路上有 N 个加油站，其中第 i 个加油站有汽油 gas[i] 升。
# 你有一辆油箱容量无限的的汽车，从第 i 个加油站开往第 i+1 个加油站需要消耗汽油 cost[i] 升。你从其中的一个加油站出发，开始时油箱为空。
# 如果你可以绕环路行驶一周，则返回出发时加油站的编号，否则返回 -1。
# 说明:
# 如果题目有解，该答案即为唯一答案。
# 输入数组均为非空数组，且长度相同。
# 输入数组中的元素均为非负数。
# 示例
# 示例 1
# 输入:
# gas  = [1,2,3,4,5]
# cost = [3,4,5,1,2]
# 输出: 3
# 解释:
# 从 3 号加油站(索引为 3 处)出发，可获得 4 升汽油。此时油箱有 = 0 + 4 = 4 升汽油
# 开往 4 号加油站，此时油箱有 4 - 1 + 5 = 8 升汽油
# 开往 0 号加油站，此时油箱有 8 - 2 + 1 = 7 升汽油
# 开往 1 号加油站，此时油箱有 7 - 3 + 2 = 6 升汽油
# 开往 2 号加油站，此时油箱有 6 - 4 + 3 = 5 升汽油
# 开往 3 号加油站，你需要消耗 5 升汽油，正好足够你返回到 3 号加油站。
# 因此，3 可为起始索引。
# 示例 2
# 输入:
# gas  = [2,3,4]
# cost = [3,4,3]
# 输出: -1
# 解释:
# 你不能从 0 号或 1 号加油站出发，因为没有足够的汽油可以让你行驶到下一个加油站。
# 我们从 2 号加油站出发，可以获得 4 升汽油。 此时油箱有 = 0 + 4 = 4 升汽油
# 开往 0 号加油站，此时油箱有 4 - 3 + 2 = 3 升汽油
# 开往 1 号加油站，此时油箱有 3 - 3 + 3 = 3 升汽油
# 你无法返回 2 号加油站，因为返程需要消耗 4 升汽油，但是你的油箱只有 3 升汽油。
# 因此，无论怎样，你都不可能绕环路行驶一周。
# 题解
# 我们可以计算出每个加油站能提供的油和到下一个加油站的消耗之差，如果这个插值是正的说明这段路程会是我们车里面的油增加，反之会使油减少
# 我们选一个点开始，一直行进，直到车里面的油是负数，我们可以得到这样的结论
# 从已经遍历的点中任意一个为起点都不能到达这个油变成负数的点后面的加油站
# 因为不管中间任意一个点汽车的油都是 >= 0 的，如果从中间的点开始，那么起始油是 0 ，肯定不会大于遍历过程中这个点的油量（因为遍历过程中肯定 >= 0，不然汽车在这个点就停了）
# 因此当遍历到小于0的点的时候，我们重新从这个点开始计算，因为上面的结论，之前遍历过的点肯定不行
# 直到最后的遍历完成，我们同事要计算整个过程中的油的储量（小于0 也要继续计算），这个储量如果大于等于 0 那么就可以循环一圈
# 因为中间每次重新开始的时候，这一段都是负数，当全程的为正数的时候，说明遍历到数组最后的时候，剩余的油量大于这些重新开始的点的负油量绝对值

from typing import List


class Solution:
    def checkIfExist(self, arr: List[int]) -> bool:
        dict = set()
        for num in arr:
            if num / 2 in dict or num * 2 in dict:
                return True
            else:
                dict.add(num)

        return False
